Repository: troeschi/Schnipsel
Catalog: Languages/Schnipsel.*.po
Languages: de

source: Comment
de: Kommentar

# tcommentdlg.cfc_label.caption
source: Comment for Code:
de: Kommentar zu Code:

# tcommentdlg.cfc_label1.caption
source: Comment for Code:
de: Kommentar zu Code

# tcommentdlg.delete_btn.caption
source: Delete
de: Löschen

# tcommentdlg.edit_comment.editlabel.caption
source: Comment:
de: Kommentar:

# tcommentdlg.edit_groupbox.caption
source: Edit / Delete
de: Ändern / Löschen

# tcommentdlg.label1.caption
source: Select Entry:
de: Eintrag wählen:

# tcommentdlg.new_comment.editlabel.caption
source: Comment:
de: Kommentar:

# tcommentdlg.new_groupbox.caption
source: New
de: Neu

# tcommentdlg.save_btn.caption
source: Save
de: Speichern

# tcommentdlg.update_btn.caption
source: Update
de: Aktualisieren

source: DataBase Configuration
de: Datenbank Konfiguration

source: Database
de: Datenbank

source: Backup DataBase
de: Datenbank sichern

source: Install / Restore DataBase
de: Installieren / Wiederherstellen

source: Test Connection
de: Verbindung Testen

source: Charset:
de: Zeichensatz:

source: DataBase:
de: Datenbank:

source: ODBC-Driver:
de: ODBC-Treiber:

source: Password:
de: Passwort:

source: Username:
de: Benutzername:

source: Export with Comments
de: Export mit Kommentaren

source: Export witth Links
de: Export mit Links

source: Export with Required
de: Export mit benötigt

source: PDF Keywords:
de: PDF Schlüsselwörter:

source: One Code per Page, if possible
de: Ein Code pro Seite wenn möglich

source: With Content Menu
de: Mit Inhaltsverzeichnis

source: PDF Subject:
de: PDF Bezug:

source: PDF Title:
de: PDF Ttel:

# tlinkdlg.delete_btn.caption
source: Delete
de: Löschen

# tlinkdlg.edit_groupbox.caption
source: Edit / Delete
de: Ändern / Speichern

# tlinkdlg.label3.caption
source: Select Entry:
de: Eintrag wählen:

# tlinkdlg.lfclabel.caption
source: Link for Code:
de: Link zu Code:

# tlinkdlg.lfclabel2.caption
source: Link for Code:
de: Link zu Code:

# tlinkdlg.new_groupbox.caption
source: New
de: Neu

# tlinkdlg.save_btn.caption
source: Save
de: Speichern

# tlinkdlg.update_btn.caption
source: Update
de: Aktualisieren

# tnewcategoriedlg.deletebtn.caption
source: Delete
de: Löschen

source: Delete Language
de: Sprache Löschen

source: Edit Language
de: Sprache bearbeiten

source: Move Code Entrys to: (select the same as above to delete Entrys)
de: Einträge verschieben nach: (Dieselbe Wahl wie oben löscht die Einträge)

source: New Language
de: Neue Sprache

source: Language Name:
de: Name der Sprache

source: New Name:
de: Neuer Name:

source: Language Menu Display:
de: Sprachanzeige im Menu:

source: New Menu Display:
de: Neue Anzeige im Menu:

# tnewcategoriedlg.savebtn.caption
source: Save
de: Speichern

# tnewcategoriedlg.savebtn2.caption
source: Update
de: Aktualisieren

source: &Close
de: &Schließen

# tnewcodeentrydlg.button1.caption
source: Create
de: Erstellen

# tnewcodeentrydlg.caption
source: New Code Entry
de: Neuer Code Eintrag

source: Language:
de: Sprache:

source: Type:
de: Typ:

source: New Code Schnipsel:
de: Neuer Code Schnipsel:

source: New Code Name:
de: Neuer Code Name:

# tnewtypedlg.deletebtn.caption
source: Delete
de: Löschen

source: Delete Type:
de: Typ löschen:

source: Edited Type name:
de: geänderter Typenname:

# tnewtypedlg.groupbox1.caption
source: New
de: Neu

source: Edit
de: Ändern

# tnewtypedlg.groupbox3.caption
source: Delete
de: Löschen

source: New Type name:
de: Neuer Typenname:

# tnewtypedlg.savebtn.caption
source: Save
de: Speichern

source: Move Code Entrys to: (Select the same as above to delete Entrys)
de: Einträge verschieben nach: (Dieselbe Wahl wie oben löscht die Einträge)

# tnewtypedlg.updatebtn.caption
source: Update
de: Aktualisieren

source: Bookmarks:
de: Lesezeichen:

source: No Link submitted
de: Kein Link übermittelt

source: Mark as Bookmark
de: Lesezeichen setzen

source: Delete Bookmark
de: Lesezeichen löschen

source: Mark as Favorite
de: Als Favorit markieren

source: Delete Favorite
de: Makierung löschen

# translate_strings.connectionok
source: Connection to MySQL or MariaDB database "Schnipsel" = OK!
de: Verbindung zu MySQL oder MariaDB Datenbank "Schnipsel" =OK!

source: Cant Connect to Database. Edit or delete Schnipsel.ini for new Configuration!
de: Kann Verbindung zu Datenbank nicht herstellen. Ändern oder löschen Sie die Datei Schnipsel.ini für eine neue Konfiguration!

source: No Entry Selected
de: Kein Eintrag gewählt

source: Delete Entry?
de: Eintrag löschen?

source: New Name cant be empty!
de: Der neue Name kann nicht leer sein!

source: Move Code Entrys from
de: Verschiebe Code Einträge von

source: to
de: nach

source: and delete
de: und löschen

source: Delete all Code Entrys in
de: Alle Code-Einträge löschen

source: Close anyway?
de: Trotzdem schliessen?

source: Code saved!
de: Code gespeichert!

source: To Many Lines
de: Zu viele Zeilen

source: Only the first 1000 Lines will be saved!
de: Nur die ersten 1000 Zeichen werden gespeichert!

source: Code in Editor not saved!
de: Code im Editor nicht gespeichert!

source: Load this Code anyway?
de: Code trotzdem laden?

source: New Code anyway?
de: Trotzdem neuen Code anlegen?

source: Delete from Exportlist?
de: Von Exportliste löschen?

source: Description:
de: Beschreibung:

source: Comments:
de: Kommentare:

source: Comment:
de: Kommentar:

source: Link Description:
de: Link Beschreibung:

# translate_strings.exportstr20
source: Required
de: Benötigt

# translate_strings.exportstr21
source: Comments
de: Kommentare

source: More than 50 Exports could be trouble..Do it anyway?
de: Mehr als 50 Exports können zu Problemen führen...Fortfahren?

source: Code is allready in Exportlist!
de: Code befindet sich bereits in der Exportliste!

source: (with required)
de: (mit benötigt)

source: (with comments)
de: (mit Kommentaren)

source: (with links)
de: (mit Links)

source: Language:
de: Sprache:

source: Type:
de: Typ:

# translate_strings.exportstr9
source: Required for Code:
de: Benötigt für Code:

source: Favorites:
de: Favoriten:

source: Install Database
de: Installiere Datenbank

# translate_strings.panel0entrys
source: No Entrys
de: Keine Einträge

source: Entrys:
de: Einträge:

source: > Not in Schnipsel <
de: > Nicht in Schnipsel <

source: > Select <
de: > Wählen <

source: Search in Codes:
de: Suche in Codes:

source: Search in Names:
de: Suche in Namen:

source: Click to show code entry
de: Für Codeansicht anklicken

source: Delete this code entry and versions of it?
de: Code und alle Versionen davon löschen?

# trequireddlg.caption
source: Required
de: Benötigt

# trequireddlg.cib_label.caption
source: Code is in Schnipsel:
de: Code ist in Schnipsel:

# trequireddlg.cib_label2.caption
source: Code is in Schnipsel:
de: Code ist in Schnipsel:

# trequireddlg.delete_btn.caption
source: Delete
de: Löschen

# trequireddlg.editgroup.caption
source: Edit / Delete
de: Ändern / Löschen

# trequireddlg.ereq_label.caption
source: Select Entry:
de: Eintrag wählen:

# trequireddlg.newgroup.caption
source: New
de: Neu

# trequireddlg.req_hint.editlabel.caption
source: Description:
de: Beschreibung:

# trequireddlg.req_hint1.editlabel.caption
source: Description:
de: Beschreibung:

# trequireddlg.rfc_label.caption
source: Required for Code:
de: Benötigt von Code:

# trequireddlg.rfc_label1.caption
source: Required for Code:
de: Benötigt von Code:

# trequireddlg.save_btn.caption
source: Save
de: Speichern

# trequireddlg.save_btn2.caption
source: Update
de: Aktualisieren

source: Show Bookmarks
de: Lesezeichen anzeigen

source: Add new version
de: Neue Version hinzufügen

source: Set bookmark
de: Lesezeichen setzen

source: Delete code
de: Code löschen

source: Delete version
de: Version löschen

source: Edit code
de: Code editieren

source: Export code
de: Code exportieren

source: Mark as favorite
de: Markierung als Favorit

source: Edit Categories
de: Sprachen ändern

source: Comments_Codename
de: Codename

# tschnipselmainform.comment_tabsheet.caption
source: Comments
de: Kommentar

source: Search for Text
de: Suche nach Text

# tschnipselmainform.db_button.hint
source: DataBase
de: Datenbank

source: EditorTB_CopyBtn
de: Kopieren

# tschnipselmainform.editortb_copybtn.hint
source: Copy
de: Kopieren

source: EditorTB_CutBtn
de: Ausschneiden

source: Cut
de: Ausschneiden

source: EditorTB_PasteBtn
de: Einfügen

source: Paste
de: Einfügen

# tschnipselmainform.editortb_replacebtn.hint
source: Replace
de: Ersetzen

source: EditorTB_SaveBtn
de: Speichern

# tschnipselmainform.editortb_savebtn.hint
source: Save
de: Speichern

# tschnipselmainform.editortb_searchbtn.hint
source: Search
de: Suche

# tschnipselmainform.editortb_selectallbtn.hint
source: Select All
de: Alles auswählen

# tschnipselmainform.edit_comments_button.caption
source: Edit Entrys
de: Einträge bearbeiten

# tschnipselmainform.edit_links_button.caption
source: Edit Entrys
de: Einträge bearbeiten

source: Enable / Disable Edit Mode
de: De-/Aktivieren Edit Modus

# tschnipselmainform.edit_required_button.caption
source: Edit Entrys
de: Einträge bearbeiten

source: English
de: Englisch

source: Export as HTML
de: nach HTML exportieren

source: Export as PDF
de: nach PDF exportieren

source: Export as XML
de: nach XML exportieren

source: Save File as
de: Datei speichern unter

source: Enable / Disable Export Mode
de: De-/Aktivieren Export Modus

source: Show Favorites
de: Favoriten anzeigen

# tschnipselmainform.finddlg.title
source: Search
de: Suche

source: German
de: Deutsch

source: Languages
de: Sprachen

source: Main Menu
de: HauptMenu

source: Add a new Code Version
de: Neue Codeversion hinzufügen

source: Mark / Unmark as Bookmark
de: Lesezeichen setzen / löschen

source: Copy Code to Clipboard
de: Kopiere Code in die Zwischenablage

source: Delete this Code and Versions
de: Diesen Code und Versionen davon löschen

source: Delete this Version of Code
de: Diese Code-Version löschen

source: Edit this Code
de: Diesen Code editieren

source: Export this Code
de: Diesen Code exportieren

source: Mark / Unmark as Favorite
de: DE-/Markierung als Favorit

source: Select / Unselect All
de: Nichts / alles auswählen

source: Send this Code to Top Window
de: Diesen Code an das Top-Fenster senden

# tschnipselmainform.mmdatabase.caption
source: DataBase
de: Datenbank

source: Toggle Edit Mode
de: Edit-Modus umschalten

source: Toggle Export Mode
de: Export-Modus umschalten

# tschnipselmainform.mmnewentry.caption
source: New Code Entry
de: Neuer Code-Eintrag

# tschnipselmainform.newcodeentry_button.hint
source: New Code Entry
de: Neuer Code-Eintrag

source: Copy to Cipboard
de: Kopiere in die Zwischenablage

source: Cut to Clipboard
de: Auschneiden

source: Edit
de: Editieren

source: Folding
de: Einklappen

source: Fold All
de: Alle einklappen

source: Paste from Clipboard
de: Einfügen

source: Replace..
de: Ersetzen...

# tschnipselmainform.popupsave.caption
source: Save
de: Speichern

source: Search..
de: Suche...

source: Search / Replace
de: Suchen / Ersetzen

source: Select All / Unselect
de: Alles / Nichts auswählen

source: Unfold All
de: Alle ausklappen

# tschnipselmainform.replacedlg.title
source: Replace
de: Ersetzen

source: Requires
de: Benötigt

source: Send to Top
de: an Top senden

source: Settings Menu
de: Einstellungen

source: Settings
de: Einstellungen

source: Translations
de: Übersetzungen

source: Types
de: Typen

source: Close
de: Schliessen

# ttopform.topmemocopy.caption
source: Copy
de: Kopieren

# ttopform.topmemoselectall.caption
source: Select All
de: Alles auswählen

source: No MySQL or MariaDB Server!
de: Kein MySQL oder MariaDB Server!

# udbconfigdlg.dbconnectionok
source: Connection to MySQL database "Schnipsel" = OK!
de: Verbindung zu MySQL Datenbank "Schnipsel" =OK!

source: No Server Info!
de: Kein Server Info!

# udbconfigdlg.nodrventrys
source: No Entrys
de: Keine Einträge

# udbconfigdlg.nodsnentrys
source: No Entrys
de: Keine Einträge

source: No Use of DSN (fill fields below)
de: DSN nicht benutzen. (untere Felder ausfüllen)

source: Install the default(Setup) Schnipsel.sql?
de: (Setup) Schnipsel.sql installieren?

source: (Click No to Select a SQL-Dump)
de: (Klicken Sie auf nein, wenn Sie einen Dump wählen wollen )
